app/Models/TikoERP/InvoiceRowModel.php

INSERT INTO `log` (`user_id`, `log_type`, `authorized_user_id`, `model_name`, `affected_id`, `after_action`, `log_action`, `log_message`, `request_data`, `created_at`, `updated_at`) VALUES ('168', 'success', NULL, 'invoice_row', 104, '{\"user_id\":\"5\",\"invoice_id\":9,\"stock_id\":\"33\",\"stock_title\":\"BURN ENERJ\\u0130 \\u0130\\u00c7ECE\\u011e\\u0130 250 ML KUTU\",\"stock_amount\":40,\"unit_id\":\"1\",\"unit_price\":\"00000\",\"subtotal_price\":0,\"total_price\":0,\"created_at\":\"2025-10-16 11:45:56\",\"updated_at\":\"2025-10-16 11:45:56\"}', 'create', NULL, '{\"palet_id\":\"085\",\"koli_sayisi\":\"40\"}', '2025-10-16 11:45:56', '2025-10-16 11:45:56')
---
    protected function afterInsert(array $data){
        $DatabaseConfig = new GeneralConfig();
        $currentDB = $DatabaseConfig->setDBConfigs();

        $db_connection = \Config\Database::connect($currentDB);
        $modelLog = model('App\Models\TikoERP\LogModel', true, $db_connection);

        $log_data = [
            'user_id' => session()->get('client_id'),
            'log_type' => 'success',
            'authorized_user_id' => session()->get('authorized_user_id'),
            'model_name' => 'invoice_row',
            'affected_id' => $data['id'],
            'after_action' => json_encode($data['data']),
            'log_action' => 'create',
            'log_message' => null,
            'request_data' => json_encode($_POST),
        ];
        $modelLog->insert($log_data);

INSERT INTO `log` (`user_id`, `log_type`, `authorized_user_id`, `model_name`, `affected_id`, `after_action`, `log_action`, `log_message`, `request_data`, `created_at`, `updated_at`) VALUES ('168', 'success', NULL, 'invoice_row', (104), '{\"stock_barcode_id\":\"55\",\"updated_at\":\"2025-10-16 11:45:56\"}', 'update', NULL, '{\"palet_id\":\"085\",\"koli_sayisi\":\"40\"}', '2025-10-16 11:45:56', '2025-10-16 11:45:56')
---
    protected function afterUpdate(array $data){
        $DatabaseConfig = new GeneralConfig();
        $currentDB = $DatabaseConfig->setDBConfigs();

        $db_connection = \Config\Database::connect($currentDB);
        $modelLog = model('App\Models\TikoERP\LogModel', true, $db_connection);

        $log_data = [
            'user_id' => session()->get('client_id'),
            'log_type' => 'success',
            'authorized_user_id' => session()->get('authorized_user_id'),
            'model_name' => 'invoice_row',
            'affected_id' => $data['id'],
            'after_action' => json_encode($data['data']),
            'log_action' => 'update',
            'log_message' => null,
            'request_data' => json_encode($_POST),
        ];
        $modelLog->insert($log_data);