app/Models/TikoERP/StockModel.php

    protected function afterUpdate(array $data){
        $DatabaseConfig = new GeneralConfig();
        $currentDB = $DatabaseConfig->setDBConfigs();

        $db_connection = \Config\Database::connect($currentDB);
        $modelLog = model('App\Models\TikoERP\LogModel', true, $db_connection);

        $log_data = [
            'user_id' => session()->get('client_id'),
            'log_type' => 'success',
            'authorized_user_id' => session()->get('authorized_user_id'),
            'model_name' => 'stock',
            'affected_id' => $data['id'],
            'after_action' => json_encode($data['data']),
            'log_action' => 'update',
            'log_message' => null,
            'request_data' => json_encode($_POST),
        ];
        $modelLog->insert($log_data);
---
INSERT INTO `log` (`user_id`, `log_type`, `authorized_user_id`, `model_name`, `affected_id`, `after_action`, `log_action`, `log_message`, `request_data`, `created_at`, `updated_at`) VALUES ('168', 'success', NULL, 'stock', ('33'), '{\"stock_total_quantity\":9960,\"updated_at\":\"2025-10-16 11:45:56\"}', 'update', NULL, '{\"palet_id\":\"085\",\"koli_sayisi\":\"40\"}', '2025-10-16 11:45:56', '2025-10-16 11:45:56')