app/Helpers/number_format_helper.php

SELECT *
FROM `money_unit`
WHERE `user_id` = '5'
AND `money_unit`.`deleted_at` IS NULL
---
  function getDynamicDBConnection()
  {
      // Kullanıcı veritabanı bilgilerini session'dan alıyoruz
      $userDatabaseDetail = [
        'hostname' => session()->get("user_item")["db_host"],
        'username' => session()->get("user_item")["db_username"],
        'password' => session()->get("user_item")["db_password"],
        'database' => session()->get("user_item")["db_name"],
        'DBDriver' => 'MySQLi',
        'DBPrefix' => '',
        'pConnect' => false,
        'DBDebug'  => (ENVIRONMENT !== 'production'),
        'charset'  => 'utf8',
        'DBCollat' => 'utf8_general_ci',
        'swapPre'  => '',
        'encrypt'  => false,
        'compress' => false,
        'strictOn' => false,
        'failover' => [],
        'port'     => 3306,
      ];

      // Dinamik veritabanı bağlantısını oluşturuyoruz
      $userGuncellemeDB = Database::connect($userDatabaseDetail);

      // Model kullanarak verileri çekiyoruz
      $model = new \App\Models\TikoERP\MoneyUnitModel($userGuncellemeDB);

      // Kullanıcıya ait verileri getiriyoruz ve return ediyoruz
      return $model->where("user_id", session()->get('user_id'))->findAll();