app/Helpers/stock_func_helper.php

UPDATE `stock` SET `stock_total_quantity` = 9960, `updated_at` = '2025-10-16 11:45:56'
WHERE `stock`.`stock_id` IN ('33')
---
function updateStockTotalQuantity($modelStock, $stockId, $quantity, $type)
{

    if($stockId > 0):
    $modelCurrentQuantity = $modelStock
        ->where('user_id', session()->get('user_id'))
        ->where('stock_id', $stockId)
        ->first();



    $currentStockQuantity = $modelCurrentQuantity['stock_total_quantity'];

    // echo "currentMainStockQuantity: ".$currentStockQuantity."  ";
    // echo "func gelen quantity: ".$quantity."  ";

    if ($type === 'add') {
        $newTotalStockQuantity = floatval($currentStockQuantity) + $quantity;
    } else if ($type === 'remove') {
        $newTotalStockQuantity = floatval($currentStockQuantity) - $quantity;
    } else {
        echo json_encode(['icon' => 'error', 'message' => "updateStockTotalQuantity işlem tipi eşleşmedi"]);
        return false;
    }

   //$modelStock->update($stockId, ['stock_total_quantity' => $newTotalStockQuantity,'manuel_add' => 1]);
     $modelStock->update($stockId, ['stock_total_quantity' => $newTotalStockQuantity]);

UPDATE `stock_warehouse_quantity` SET `stock_quantity` = 9960, `updated_at` = '2025-10-16 11:45:56'
WHERE `stock_warehouse_quantity`.`id` IN ('28')
---

        //depo stok miktarlarını günceller
        if(isset($StockWarehouseQuantity_item_parent)):
        $modelStockWarehouseQuantity->update($StockWarehouseQuantity_item_parent['id'], ['stock_quantity' => $parentQuantity]);
        endif;
        $modelStockWarehouseQuantity->update($StockWarehouseQuantity_item_child['id'], ['stock_quantity' => $childQuantity]);