app/Controllers/TikoPortal/User.php

SELECT *
FROM `user`
JOIN `user_app` ON `user`.`user_id` = `user_app`.`user_id`
JOIN `app` ON `app`.`app_id` = `user_app`.`app_id`
WHERE `app`.`app_title` = 'ERP'
AND `user_eposta` = 'admin@kelesoglu.com'
AND `status` = 'active'
AND `user`.`deleted_at` IS NULL
 LIMIT 1
---
    public function checkLogin()
    {
        helper('form');
        helper('text');

        $form_validation = \Config\Services::validation();
        $user_customizes = [];

        if ($this->request->getMethod(true) == 'POST') {
            $data = [
                'user_eposta' => $this->request->getPost('user_eposta'),
                'user_password' => $this->request->getPost('user_password')
            ];

            if (!$form_validation->run($data, 'loginRules')) {
                echo json_encode(['icon' => 'error', 'message' => $form_validation->getErrors()]);
                return;
            } else {
                $user_item = $this->modelUser->join('user_app', 'user.user_id = user_app.user_id')
                    ->join('app', 'app.app_id = user_app.app_id')
                    ->where('app.app_title', ENV('APP_NAME'))
                    ->where('user_eposta', $data['user_eposta'])
                    ->where('status', 'active')
                    ->first();

SELECT *
FROM `user_permission`
JOIN `module` ON `module`.`module_id` = `user_permission`.`module_id`
WHERE `user_permission`.`client_id` = '5'
AND `user_permission`.`deleted_at` IS NULL
SELECT *
FROM `user_view_customize`
WHERE `user_id` = '5'
AND `user_view_customize`.`deleted_at` IS NULL
SELECT *
FROM `department`
WHERE `department_status` = 'active'
AND `department`.`deleted_at` IS NULL
ORDER BY `department_order` ASC
SELECT *
FROM `bank`
WHERE `bank_status` = 'active'
AND `bank`.`deleted_at` IS NULL
ORDER BY `bank_order` ASC
SELECT *
FROM `invoice_tax_rate`
WHERE `tax_status` = 'active'
AND `invoice_tax_rate`.`deleted_at` IS NULL
ORDER BY `tax_order` ASC
SELECT *
FROM `money_unit`
WHERE `user_id` = '5'
AND `status` = 'active'
AND `money_unit`.`deleted_at` IS NULL
ORDER BY `id` ASC
---
                    //     ->where('user_module.user_id', $user_item['user_id'])
                    //     ->where('user_module.status', 'active')
                    //     ->findAll();
                    $user_modules = $this->modelUserPermission->join('module', 'module.module_id = user_permission.module_id')
                        ->where('user_permission.client_id', $user_item['client_id'])
                        ->findAll();
                    $customize_items = $this->modelUserViewCustomize->where('user_id', $user_item['user_id'])->findAll();

                    # TODO: İlerleyen zamanlarda sorguları ve logic işlemleri optimize etmek adına aşağıdaki veriler 'id' => [item] şeklinde
                    # maplenerek koyulabilir. Ancak bu sefer order columnu gereksiz kalıyor. O yüzden şu anda bu konunun üzerinde çok
                    # durmaya gerek yok. İleride bu verileri cacheleyeceğimiz zaman tekrardan gündeme gelebilir.
                    $department_items = $this->modelDepartment->where('department_status', 'active')->orderBy('department_order', 'ASC')->findAll();
                    $bank_items = $this->modelBank->where('bank_status', 'active')->orderBy('bank_order', 'ASC')->findAll();
                    $withholding_items = $this->modelWithholding->where('withholding_status', 'active')->orderBy('withholding_order', 'ASC')->findAll();
                    $exception_type_items = $this->modelExceptionType->where('exception_status', 'active')->orderBy('exception_order', 'ASC')->findAll();
                    $special_base_items = $this->modelSpecialBase->where('special_base_status', 'active')->orderBy('special_base_order', 'ASC')->findAll();
                    $tax_rate_items = $this->modelTaxRate->where('tax_status', 'active')->orderBy('tax_order', 'ASC')->findAll();
                    $money_items = $this->modelMoneyUnit->where('user_id', $user_item['user_id'])->where('status', 'active')->orderBy('id', 'ASC')->findAll();

INSERT INTO `user` (`user_id`, `operation`, `user_eposta`, `user_password`, `user_telefon`, `firma_adi`, `pin`, `user_adsoyad`, `created_at`, `updated_at`) VALUES ('5', '0', 'okeles@kelesoglugrup.com', 'ba03b551c122e36e00cda0715d51e2e6b00e7359bc24e08efa51ed5cc80513382c5cd3a37e2aa8eb243586e9a1e18626d17ac180443fd562086c6ea39d3c149a54d7fed280cd7472bea67651e2f0ee0b727e793ecafa0ab38fa13320df0364', '(000)0000000', 'Keleşoğlu Grup', '3603', 'Osman KELEŞ', '2025-09-01 12:32:54', '2025-09-01 12:32:54')
---
                    'pin' => $user_pin,
                    'user_adsoyad' => $user_adsoyad,
                ];
                $this->modelUser->insert($insert_data);

SELECT *
FROM `user`
LEFT JOIN `user_permission` ON `user_permission`.`client_id` = `user`.`client_id`
WHERE `user`.`client_id` = '160'
AND `user`.`deleted_at` IS NULL
 LIMIT 1
---
    public function userEdit()
    {
        $data_form = $this->request->getPost('formData');
        $data_list = $this->request->getPost('list');


        foreach ($data_form as $data) {
            $key = $data['name'];
            $value = $data['value'];
            $new_data_form[$key] = $value;
        }

        $user_item = $this->modelUser->where('user.client_id', $new_data_form['client_id'])->join('user_permission', 'user_permission.client_id = user.client_id', 'left')->first();

UPDATE `user` SET `firma_adi` = 'Keleşoğlu Grup', `user_adsoyad` = 'Osman KELEŞ', `user_telefon` = '(000) 000 0000', `user_eposta` = 'okeles@kelesoglugrup.com', `operation` = '0', `user_password` = '035014bb59b5243af53bb5cb9e73310ca61e7c794992182b5161a4642c6f471e3eb63d5d46ebfb8745c82bc62c7df294dd54405d55e68c5f65fb9d8889832b310e30b860bfe31f08e8dac04b01b7feeb731cc6846913332afd9f803e8f9414', `status` = 'active', `pin` = '3603', `updated_at` = '2025-09-01 12:33:40'
WHERE `user`.`client_id` IN ('160')
---
            'pin' => $user_pin,
        ];
        if(strlen($user_pin) == 4){
            $this->modelUser->update($client_id, $update_data);

SELECT *
FROM `operation`
WHERE `user_id` = '5'
---

        $this->userDatabaseConnect = $this->userDatabase();

        $operation = $this->userDatabaseConnect->table("operation")->where("user_id", session()->get('user_id'))->get();

INSERT INTO `user_permission` (`client_id`, `user_id`, `module_id`, `created_at`, `updated_at`) VALUES ('160', '4', '1', '2025-09-01 12:33:40', '2025-09-01 12:33:40')
SELECT *
FROM `user_permission`
JOIN `module` ON `module`.`module_id` = `user_permission`.`module_id`
WHERE `module`.`module_id` = '1'
AND `user_permission`.`deleted_at` IS NULL
---
                        'user_id' => $user_id,
                        'module_id' => $item['value'],
                    ];
                    $this->modelUserPermission->insert($insert_data);

                    $user_modules = $this->modelUserPermission->join('module', 'module.module_id = user_permission.module_id')
                        ->where('module.module_id', $item['value'])
                        ->findAll();

SELECT *
FROM `user_permission`
WHERE `client_id` = '160'
AND `module_id` = '3'
AND `user_permission`.`deleted_at` IS NULL
 LIMIT 1
---
            }
            if (isset($permission_list_u) && is_array($permission_list_u)) {
            foreach ($permission_list_u as $item) { // burada hataa veriyor
                $user_modules11 = $this->modelUserPermission
                    ->where('client_id', $client_id)
                    ->where('module_id', $item['value'])
                    ->first();

SELECT `u`.*
FROM `user`
LEFT JOIN `user` `u` ON `user`.`client_id` = `u`.`user_id`
WHERE `user`.`client_id` = '5'
AND `u`.`super_admin` = 0
AND u.deleted_at IS NULL
AND `user`.`deleted_at` IS NULL
ORDER BY `created_at` DESC
SELECT *
FROM `module`
SELECT *
FROM `operation`
WHERE `user_id` = '5'
---
    public function userList($date_start = null)
    {
        $page_title = "Kullanıcı Yönetimi";

        $user_list = $this->modelUser
            ->join('user u', 'user.client_id = u.user_id', 'left')
            ->where('user.client_id', session()->get('user_id'))
            ->where('u.super_admin', 0)
            ->where('u.deleted_at IS NULL', null, false)
            ->select('u.*')
            ->orderBy("created_at", "DESC")
            ->findAll();

        $all_module = $this->modelModule
            ->withDeleted()
            ->findAll();

            $this->userDatabaseConnect = $this->userDatabase();

            $operation = $this->userDatabaseConnect->table("operation")->where("user_id", session()->get('user_id'))->get();

SELECT *
FROM `user_permission`
WHERE `client_id` = '160'
AND `user_permission`.`deleted_at` IS NULL
---
    private function checkUserPermission($client_id, $module_id)
    {
        $all_user_permission = $this->modelUserPermission
            ->where('client_id', $client_id)
            ->findAll();