app/Controllers/TikoERP/Home.php

SELECT *
FROM `operation`
WHERE `operation_id` = '21'
AND `operation`.`deleted_at` IS NULL
 LIMIT 1
SELECT `production_row_operation`.*, `stock`.`default_image`, `stock`.`parent_id`
FROM `production_row_operation`
JOIN `stock` ON `stock`.`stock_id` = `production_row_operation`.`stock_id`
WHERE `production_row_operation`.`status` = 'Beklemede'
AND `production_row_operation`.`operation_id` = '21'
---



                $operasyonlar = $this->modelOperation->where("operation_id", session("user_item")["operation"])->first();

                $beklemede_operasyonlar = $this->modelProductionOperation
                                               ->select('production_row_operation.*, stock.default_image, stock.parent_id')
                                               ->join("stock", "stock.stock_id = production_row_operation.stock_id")
                                               ->where("production_row_operation.status", "Beklemede")
                                               ->where("production_row_operation.operation_id", session("user_item")["operation"])
                                               ->findAll();

SELECT `production_row_operation`.*, `stock`.`default_image`, `stock`.`parent_id`
FROM `production_row_operation`
JOIN `stock` ON `stock`.`stock_id` = `production_row_operation`.`stock_id`
WHERE `production_row_operation`.`status` = 'İşlemde'
OR `production_row_operation`.`status` = 'Durdu'
OR `production_row_operation`.`status` = 'Devam'
AND `production_row_operation`.`operation_id` = '21'
---
                                            }


                  $islemde_operasyonlar = $this->modelProductionOperation
                                               ->select('production_row_operation.*, stock.default_image, stock.parent_id')
                                               ->join("stock", "stock.stock_id = production_row_operation.stock_id")
                                               ->where("production_row_operation.status", "İşlemde")
                                               ->orWhere("production_row_operation.status", "Durdu")
                                               ->orWhere("production_row_operation.status", "Devam")
                                               ->where("production_row_operation.operation_id", session("user_item")["operation"])
                                               ->findAll();

SELECT `production_row_operation`.*, `stock`.`default_image`, `stock`.`parent_id`
FROM `production_row_operation`
JOIN `stock` ON `stock`.`stock_id` = `production_row_operation`.`stock_id`
WHERE `production_row_operation`.`status` = 'Bitti'
AND `production_row_operation`.`operation_id` = '21'
---



                $bitti_operasyonlar = $this->modelProductionOperation
                                                ->select('production_row_operation.*, stock.default_image, stock.parent_id')
                                                ->join("stock", "stock.stock_id = production_row_operation.stock_id")
                                                ->where("production_row_operation.status", "Bitti")
                                                ->where("production_row_operation.operation_id", session("user_item")["operation"])
                                                ->findAll();

SELECT *
FROM `boxes`
SELECT *
FROM `order_row`
WHERE `kutu_id` IS NOT NULL
AND `order_row`.`deleted_at` IS NULL
SELECT *
FROM `category`
WHERE `category_id` = 115
AND `category`.`deleted_at` IS NULL
 LIMIT 1
SELECT *
FROM `stock`
WHERE `category_id` = 115
AND `stock`.`deleted_at` IS NULL
SELECT `stock`.*, `type`.`type_title`, `stock_recipe`.*, `buy_unit`.`unit_value` as `buy_unit_value`, `sale_unit`.`unit_id` as `sale_unit_id`, `buy_money_unit`.`money_icon` as `buy_money_icon`, `sale_money_unit`.`money_icon` as `sale_money_icon`, `buy_money_unit`.`money_title` as `buy_money_title`, `sale_money_unit`.`money_title` as `sale_money_title`, `recipe_item`.*
FROM `recipe_item`
JOIN `stock_recipe` ON `stock_recipe`.`recipe_id` = `recipe_item`.`recipe_id`
JOIN `stock` ON `recipe_item`.`stock_id` = `stock`.`stock_id`
LEFT JOIN `type` ON `stock`.`type_id` = `type`.`type_id`
JOIN `unit` as `buy_unit` ON `buy_unit`.`unit_id` = `stock`.`buy_unit_id`
JOIN `unit` as `sale_unit` ON `sale_unit`.`unit_id` = `stock`.`sale_unit_id`
JOIN `money_unit` as `buy_money_unit` ON `buy_money_unit`.`money_unit_id` = `stock`.`buy_money_unit_id`
JOIN `money_unit` as `sale_money_unit` ON `sale_money_unit`.`money_unit_id` = `stock`.`sale_money_unit_id`
WHERE `stock_recipe`.`stock_id` = '85'
AND `recipe_item`.`deleted_at` IS NULL
SELECT `stock`.*, `type`.`type_title`, `stock_recipe`.*, `buy_unit`.`unit_value` as `buy_unit_value`, `sale_unit`.`unit_id` as `sale_unit_id`, `buy_money_unit`.`money_icon` as `buy_money_icon`, `sale_money_unit`.`money_icon` as `sale_money_icon`, `buy_money_unit`.`money_title` as `buy_money_title`, `sale_money_unit`.`money_title` as `sale_money_title`, `recipe_item`.*
FROM `recipe_item`
JOIN `stock_recipe` ON `stock_recipe`.`recipe_id` = `recipe_item`.`recipe_id`
JOIN `stock` ON `recipe_item`.`stock_id` = `stock`.`stock_id`
LEFT JOIN `type` ON `stock`.`type_id` = `type`.`type_id`
JOIN `unit` as `buy_unit` ON `buy_unit`.`unit_id` = `stock`.`buy_unit_id`
JOIN `unit` as `sale_unit` ON `sale_unit`.`unit_id` = `stock`.`sale_unit_id`
JOIN `money_unit` as `buy_money_unit` ON `buy_money_unit`.`money_unit_id` = `stock`.`buy_money_unit_id`
JOIN `money_unit` as `sale_money_unit` ON `sale_money_unit`.`money_unit_id` = `stock`.`sale_money_unit_id`
WHERE `stock_recipe`.`stock_id` = '82'
AND `recipe_item`.`deleted_at` IS NULL
---
                $bitti_count = $this->modelProductionOperation->where("status", "Bitti")->where("operation_id", session("user_item")["operation"])->countAllResults();

                $sevkler = $this->modelEmirler->orderBy("sevk_id", "DESC")->findAll();
                $kutular = $this->modelBox->findAll();
                foreach($kutular as $index => $satirlar){
                    $kutular[$index]["satirlar"] = $this->modelBoxRow->where("kutu_id", $satirlar["id"])->findAll();
                }
                $order_satirlar = $this->modelOrderRow->where("kutu_id !=", NULL)->findAll();


                $Kategoriler = $this->modelCategory->where("category_id", 115)->first();
                $kategori_urunleri = $this->modelStock->where("category_id", 115)->findAll();

                foreach($kategori_urunleri as &$urun){
                    $urun["stok_koli"] =  $this->modelRecipeItem->join('stock_recipe', 'stock_recipe.recipe_id = recipe_item.recipe_id')
                    ->join('stock', 'recipe_item.stock_id = stock.stock_id')
                    ->join('type', 'stock.type_id = type.type_id','left')
                    ->join('unit as buy_unit', 'buy_unit.unit_id = stock.buy_unit_id')
                    ->join('unit as sale_unit', 'sale_unit.unit_id = stock.sale_unit_id')
                    ->join('money_unit as buy_money_unit', 'buy_money_unit.money_unit_id = stock.buy_money_unit_id')
                    ->join('money_unit as sale_money_unit', 'sale_money_unit.money_unit_id = stock.sale_money_unit_id')
                    ->select('stock.*, type.type_title, stock_recipe.*, buy_unit.unit_value as buy_unit_value, sale_unit.unit_id as sale_unit_id, buy_money_unit.money_icon as buy_money_icon, sale_money_unit.money_icon as sale_money_icon, buy_money_unit.money_title as buy_money_title, sale_money_unit.money_title as sale_money_title, recipe_item.*')
                    ->where('stock_recipe.stock_id', $urun["stock_id"])
                    ->findAll();
                    foreach($urun["stok_koli"] as &$recete){
                        $recete["koli_recete"] = $this->modelRecipeItem->join('stock_recipe', 'stock_recipe.recipe_id = recipe_item.recipe_id')
                        ->join('stock', 'recipe_item.stock_id = stock.stock_id')
                        ->join('type', 'stock.type_id = type.type_id','left')
                        ->join('unit as buy_unit', 'buy_unit.unit_id = stock.buy_unit_id')
                        ->join('unit as sale_unit', 'sale_unit.unit_id = stock.sale_unit_id')
                        ->join('money_unit as buy_money_unit', 'buy_money_unit.money_unit_id = stock.buy_money_unit_id')
                        ->join('money_unit as sale_money_unit', 'sale_money_unit.money_unit_id = stock.sale_money_unit_id')
                        ->select('stock.*, type.type_title, stock_recipe.*, buy_unit.unit_value as buy_unit_value, sale_unit.unit_id as sale_unit_id, buy_money_unit.money_icon as buy_money_icon, sale_money_unit.money_icon as sale_money_icon, buy_money_unit.money_title as buy_money_title, sale_money_unit.money_title as sale_money_title, recipe_item.*')
                        ->where('stock_recipe.stock_id', $recete["stock_id"])
                        ->findAll();

SELECT *
FROM `invoice_outgoing_status`
WHERE `invoice_outgoing_status`.`deleted_at` IS NULL
---
    private function addInvoiceStatusToQuery()
    {

        return $this->InvoiceOutgoingStatusModel->findAll();

SELECT *
FROM `stock`
WHERE `stock_id` = '086'
AND `stock`.`deleted_at` IS NULL
 LIMIT 1
SELECT `buy_money_unit`.`money_icon` as `buy_money_icon`, `buy_money_unit`.`money_code` as `buy_money_code`, `stock`.*, `sale_unit`.*
FROM `stock`
JOIN `money_unit` as `buy_money_unit` ON `buy_money_unit`.`money_unit_id` = `stock`.`buy_money_unit_id`
JOIN `unit` as `sale_unit` ON `sale_unit`.`unit_id` = `stock`.`sale_unit_id`
WHERE `stock`.`user_id` = '5'
AND `stock`.`stock_id` = '086'
AND `stock`.`deleted_at` IS NULL
 LIMIT 1
---
    public function paletSatisControl()
    {
        $palet_id = $this->request->getPost('palet_id');
        $stokBul = $this->modelStock->where('stock_id', $palet_id)->first();
        if($stokBul){

            $stock_item = $this->modelStock->join('money_unit as buy_money_unit', 'buy_money_unit.money_unit_id = stock.buy_money_unit_id')
            ->join('unit as sale_unit', 'sale_unit.unit_id = stock.sale_unit_id')
            ->where('stock.user_id', session()->get('user_id'))
            ->where('stock.stock_id', $palet_id)
            ->select('buy_money_unit.money_icon as buy_money_icon, buy_money_unit.money_code as buy_money_code, stock.*, sale_unit.*')
            ->first();

SELECT `stock`.*, `type`.`type_title`, `stock_recipe`.*, `buy_unit`.`unit_value` as `buy_unit_value`, `sale_unit`.`unit_id` as `sale_unit_id`, `buy_money_unit`.`money_icon` as `buy_money_icon`, `sale_money_unit`.`money_icon` as `sale_money_icon`, `buy_money_unit`.`money_title` as `buy_money_title`, `sale_money_unit`.`money_title` as `sale_money_title`, `recipe_item`.*
FROM `recipe_item`
JOIN `stock_recipe` ON `stock_recipe`.`recipe_id` = `recipe_item`.`recipe_id`
JOIN `stock` ON `recipe_item`.`stock_id` = `stock`.`stock_id`
LEFT JOIN `type` ON `stock`.`type_id` = `type`.`type_id`
JOIN `unit` as `buy_unit` ON `buy_unit`.`unit_id` = `stock`.`buy_unit_id`
JOIN `unit` as `sale_unit` ON `sale_unit`.`unit_id` = `stock`.`sale_unit_id`
JOIN `money_unit` as `buy_money_unit` ON `buy_money_unit`.`money_unit_id` = `stock`.`buy_money_unit_id`
JOIN `money_unit` as `sale_money_unit` ON `sale_money_unit`.`money_unit_id` = `stock`.`sale_money_unit_id`
WHERE `stock_recipe`.`stock_id` = '085'
AND `recipe_item`.`deleted_at` IS NULL
---
    private function getRecipeItems($stock_id)
    {
        return $this->modelRecipeItem
            ->join('stock_recipe', 'stock_recipe.recipe_id = recipe_item.recipe_id')
            ->join('stock', 'recipe_item.stock_id = stock.stock_id')
            ->join('type', 'stock.type_id = type.type_id', 'left')
            ->join('unit as buy_unit', 'buy_unit.unit_id = stock.buy_unit_id')
            ->join('unit as sale_unit', 'sale_unit.unit_id = stock.sale_unit_id')
            ->join('money_unit as buy_money_unit', 'buy_money_unit.money_unit_id = stock.buy_money_unit_id')
            ->join('money_unit as sale_money_unit', 'sale_money_unit.money_unit_id = stock.sale_money_unit_id')
            ->select('stock.*, type.type_title, stock_recipe.*, buy_unit.unit_value as buy_unit_value, sale_unit.unit_id as sale_unit_id, buy_money_unit.money_icon as buy_money_icon, sale_money_unit.money_icon as sale_money_icon, buy_money_unit.money_title as buy_money_title, sale_money_unit.money_title as sale_money_title, recipe_item.*')
            ->where('stock_recipe.stock_id', $stock_id)
            ->findAll();

SELECT `stock_total_quantity`
FROM `stock`
WHERE `stock`.`deleted_at` IS NULL
AND `stock`.`stock_id` = '33'
---
    public function getStockQuantity($stockId)
    {
        // Stock tablosundan direkt stock_total_quantity alanını al
        $stock = $this->modelStock->select('stock_total_quantity')->find($stockId);

SELECT `buy_money_unit`.`money_icon` as `buy_money_icon`, `buy_money_unit`.`money_code` as `buy_money_code`, `stock`.*, `sale_unit`.*, `cari`.`name`, `cari`.`surname`, `cari`.`invoice_title`
FROM `stock`
JOIN `money_unit` as `buy_money_unit` ON `buy_money_unit`.`money_unit_id` = `stock`.`buy_money_unit_id`
JOIN `unit` as `sale_unit` ON `sale_unit`.`unit_id` = `stock`.`sale_unit_id`
JOIN `cari` ON `cari`.`cari_id` = `stock`.`cari_id`
WHERE `stock`.`user_id` = '5'
AND `stock`.`stock_id` = '085'
AND `stock`.`deleted_at` IS NULL
 LIMIT 1
---
    public function printEtiket()
    {
        $palet_id = $this->request->getPost('palet_id');
        $koli_sayisi = $this->request->getPost('koli_sayisi');

        // Palet bilgilerini al (cari bilgileri ile birlikte)
        $palet_bilgisi = $this->modelStock->join('money_unit as buy_money_unit', 'buy_money_unit.money_unit_id = stock.buy_money_unit_id')
            ->join('unit as sale_unit', 'sale_unit.unit_id = stock.sale_unit_id')
            ->join('cari', 'cari.cari_id = stock.cari_id')
            ->where('stock.user_id', session()->get('user_id'))
            ->where('stock.stock_id', $palet_id)
            ->select('buy_money_unit.money_icon as buy_money_icon, buy_money_unit.money_code as buy_money_code, stock.*, sale_unit.*, cari.name, cari.surname, cari.invoice_title')
            ->first();

SELECT *
FROM `cari`
LEFT JOIN `address` ON `cari`.`cari_id` = `address`.`cari_id`
WHERE `cari`.`cari_id` = '4980'
AND `cari`.`user_id` = '5'
AND `cari`.`deleted_at` IS NULL
 LIMIT 1
---
        $transaction_note = "P" . $palet_id . " - Palet Etiket Yazdırma Sonrası Otomatik Stoktan Çıkış";

        // Cari bilgilerini al
        $supplier = $this->modelCari->join('address', 'cari.cari_id = address.cari_id', 'left')
            ->where('cari.cari_id', $supplier_id)
            ->where('cari.user_id', session()->get('user_id'))
            ->first();

SELECT *
FROM `stock`
WHERE `stock`.`deleted_at` IS NULL
AND `stock`.`stock_id` = '33'
---
            // Toplam tutarı hesapla (tüm ürünler için)
            $toplam_tutar = 0;
            foreach ($cikarilacak_stok as $urun) {
                $urun_bilgisi = $this->modelStock->find($urun['urun_id']);

INSERT INTO `invoice` (`user_id`, `money_unit_id`, `sale_type`, `invoice_no`, `invoice_direction`, `invoice_date`, `expiry_date`, `currency_amount`, `invoice_note`, `stock_total`, `stock_total_try`, `sub_total`, `sub_total_try`, `grand_total`, `grand_total_try`, `amount_to_be_paid`, `amount_to_be_paid_try`, `cari_identification_number`, `cari_tax_administration`, `cari_id`, `cari_invoice_title`, `cari_name`, `cari_surname`, `cari_obligation`, `cari_company_type`, `cari_phone`, `cari_email`, `address_country`, `address_city`, `address_city_plate`, `address_district`, `address_zip_code`, `address`, `invoice_status_id`, `created_at`, `updated_at`) VALUES ('5', 1, 'quick', 'PALET-845280', 'outgoing_invoice', '2025-10-16 11:45:56', '2025-10-16 11:45:56', 1, 'P085 - Palet Etiket Yazdırma Sonrası Otomatik Stoktan Çıkış', 0, 0, 0, 0, 0, 0, 0, 0, '0000000000', 'CARREFOUR', '4980', 'CARREFOUR', '', '', 'e-archive', 'company', '+90 0000000000', NULL, 'TR', '', '', 'Nilüfer', '0', 'CARREFOUR', '1', '2025-10-16 11:45:56', '2025-10-16 11:45:56')
---
            // print_r(str_replace(',', '.', $stock_quantity) * str_replace(',', '.', $buy_unit_price));
            // print_r((str_replace(',', '.', $stock_quantity) * str_replace(',', '.', $buy_unit_price)) * str_replace(',', '.', $currency_amount));

            $this->modelInvoice->insert($insert_invoice_data);

SELECT *
FROM `financial_movement`
WHERE `user_id` = '5'
AND `financial_movement`.`deleted_at` IS NULL
ORDER BY `transaction_counter` DESC
 LIMIT 1
---

            // Finansal hareket oluştur
            $currentDateTime = new Time('now', 'Turkey', 'en_US');
            $last_transaction = $this->modelFinancialMovement->where('user_id', session()->get('user_id'))->orderBy('transaction_counter', 'DESC')->first();

INSERT INTO `financial_movement` (`user_id`, `cari_id`, `money_unit_id`, `transaction_number`, `transaction_direction`, `transaction_type`, `invoice_id`, `transaction_tool`, `transaction_title`, `transaction_description`, `transaction_amount`, `transaction_real_amount`, `transaction_date`, `transaction_prefix`, `transaction_counter`, `created_at`, `updated_at`) VALUES ('5', '4980', 1, 'PALET000006', 'entry', 'outgoing_invoice', 9, 'not_payroll', 'Palet Etiket Yazdırma - Stoktan Çıkış', 'Palet Etiket Yazdırma - Stoktan Çıkış', 0, 0, '2025-10-16 11:45:56', 'PALET', 6, '2025-10-16 11:45:56', '2025-10-16 11:45:56')
---
                'transaction_prefix' => $stock_entry_prefix,
                'transaction_counter' => $transaction_counter
            ];
            $this->modelFinancialMovement->insert($insert_financial_movement_data);

UPDATE `cari` SET `cari_balance` = 0, `updated_at` = '2025-10-16 11:45:56'
WHERE `cari`.`cari_id` IN ('4980')
---
            $update_cari_data = [
                'cari_balance' => $supplier['cari_balance'] + $amount_to_be_processed
            ];
            $this->modelCari->update($supplier['cari_id'], $update_cari_data);

UPDATE `financial_movement` SET `invoice_id` = 9, `updated_at` = '2025-10-16 11:45:56'
WHERE `financial_movement`.`financial_movement_id` IN (8)
---
            $update_modelFinancialMovement_data = [
                'invoice_id' => $invoice_id,
            ];
            $this->modelFinancialMovement->update($financialMovement_id, $update_modelFinancialMovement_data);

SELECT *
FROM `stock`
WHERE `stock`.`deleted_at` IS NULL
AND `stock`.`stock_id` = '33'
---
        // Her ürün için stok çıkış işlemi yap
        if ($invoice_id > 0) {
            foreach ($cikarilacak_stok as $urun) {
                $urun_bilgisi = $this->modelStock->find($urun['urun_id']);

INSERT INTO `invoice_row` (`user_id`, `invoice_id`, `stock_id`, `stock_title`, `stock_amount`, `unit_id`, `unit_price`, `subtotal_price`, `total_price`, `created_at`, `updated_at`) VALUES ('5', 9, '33', 'BURN ENERJİ İÇECEĞİ 250 ML KUTU', 40, '1', '00000', 0, 0, '2025-10-16 11:45:56', '2025-10-16 11:45:56')
SELECT *
FROM `stock_barcode`
JOIN `stock` ON `stock`.`stock_id` = `stock_barcode`.`stock_id`
WHERE `stock_barcode`.`stock_id` = '33'
AND `stock_barcode`.`warehouse_id` = 1
AND `stock_barcode`.`deleted_at` IS NULL
---
                    'subtotal_price' => $stock_total,
                    'total_price' => $stock_total,
                ];
                $this->modelInvoiceRow->insert($insert_invoice_row_data);
                $invoice_row_id = $this->modelInvoiceRow->getInsertID();

                // Stok hareketi oluştur
                $stock_barcode_all = $this->modelStockBarcode->join('stock', 'stock.stock_id = stock_barcode.stock_id')
                    ->where('stock_barcode.stock_id', $urun['urun_id'])
                    ->where('stock_barcode.warehouse_id', $warehouse_id)
                    ->findAll();

SELECT *
FROM `stock_movement`
WHERE `user_id` = '5'
AND `stock_movement`.`deleted_at` IS NULL
ORDER BY `transaction_counter` DESC
 LIMIT 1
---
                    $varMi = $stock_barcode_item['total_amount'] - $stock_barcode_item['used_amount'];

                    if ($varMi >= $kullanilacak_miktar) {
                        $last_transaction = $this->modelStockMovement->where('user_id', session()->get('user_id'))->orderBy('transaction_counter', 'DESC')->first();

INSERT INTO `stock_movement` (`user_id`, `stock_barcode_id`, `invoice_id`, `movement_type`, `transaction_number`, `transaction_note`, `from_warehouse`, `transaction_info`, `sale_unit_price`, `sale_money_unit_id`, `transaction_quantity`, `transaction_date`, `transaction_prefix`, `transaction_counter`, `created_at`, `updated_at`) VALUES ('5', '55', 9, 'outgoing', 'PALET000050', NULL, 1, 'P085 - Palet Etiket Yazdırma Sonrası Otomatik Stoktan Çıkış', '0.0000', '3', 40, '2025-10-16 11:45:56', 'PALET', 50, '2025-10-16 11:45:56', '2025-10-16 11:45:56')
---
                            'transaction_prefix' => $transaction_prefix,
                            'transaction_counter' => $transaction_counter,
                        ];
                        $this->modelStockMovement->insert($insert_stock_movement_data);

UPDATE `stock_barcode` SET `used_amount` = 40, `stock_barcode_status` = 'available', `updated_at` = '2025-10-16 11:45:56'
WHERE `stock_barcode`.`stock_barcode_id` IN ('55')
---
                            'used_amount' => $used_amount,
                            'stock_barcode_status' => $stock_barcode_status
                        ];
                        $this->modelStockBarcode->update($stock_barcode_item['stock_barcode_id'], $update_stock_barcode_data);

UPDATE `invoice_row` SET `stock_barcode_id` = '55', `updated_at` = '2025-10-16 11:45:56'
WHERE `invoice_row`.`invoice_row_id` IN (104)
---
                        $update_invoice_row_data = [
                            'stock_barcode_id' => $stock_barcode_item['stock_barcode_id'],
                        ];
                        $this->modelInvoiceRow->update($invoice_row_id, $update_invoice_row_data);

SELECT SUM(`invoice_row`.`stock_amount`) AS `stock_amount`
FROM `invoice_row`
JOIN `invoice` ON `invoice`.`invoice_id` = `invoice_row`.`invoice_id`
WHERE `invoice_row`.`stock_id` = '33'
AND `invoice_row`.`user_id` = '5'
AND `invoice`.`invoice_direction` = 'incoming_invoice'
AND `invoice`.`deleted_at` IS NULL
AND `invoice_row`.`deleted_at` IS NULL
 LIMIT 1
---
    private function stokHesaplaFaturalardan($stock_id, $user_id)
    {
        // Alış faturalarından eklenen miktarları hesapla
        $alis_miktari = $this->modelInvoiceRow
            ->join('invoice', 'invoice.invoice_id = invoice_row.invoice_id')
            ->where('invoice_row.stock_id', $stock_id)
            ->where('invoice_row.user_id', $user_id)
            ->where('invoice.invoice_direction', 'incoming_invoice')
            ->where('invoice.deleted_at IS NULL')
            ->selectSum('invoice_row.stock_amount')
            ->first();