app/Controllers/TikoERP/Home.php




                $operasyonlar = $this->modelOperation->where("operation_id", session("user_item")["operation"])->first();

                $beklemede_operasyonlar = $this->modelProductionOperation
                                               ->select('production_row_operation.*, stock.default_image, stock.parent_id')
                                               ->join("stock", "stock.stock_id = production_row_operation.stock_id")
                                               ->where("production_row_operation.status", "Beklemede")
                                               ->where("production_row_operation.operation_id", session("user_item")["operation"])
                                               ->findAll();
---
SELECT *
FROM `operation`
WHERE `operation_id` = '21'
AND `operation`.`deleted_at` IS NULL
 LIMIT 1
SELECT `production_row_operation`.*, `stock`.`default_image`, `stock`.`parent_id`
FROM `production_row_operation`
JOIN `stock` ON `stock`.`stock_id` = `production_row_operation`.`stock_id`
WHERE `production_row_operation`.`status` = 'Beklemede'
AND `production_row_operation`.`operation_id` = '21'

                                            }


                  $islemde_operasyonlar = $this->modelProductionOperation
                                               ->select('production_row_operation.*, stock.default_image, stock.parent_id')
                                               ->join("stock", "stock.stock_id = production_row_operation.stock_id")
                                               ->where("production_row_operation.status", "İşlemde")
                                               ->orWhere("production_row_operation.status", "Durdu")
                                               ->orWhere("production_row_operation.status", "Devam")
                                               ->where("production_row_operation.operation_id", session("user_item")["operation"])
                                               ->findAll();
---
SELECT `production_row_operation`.*, `stock`.`default_image`, `stock`.`parent_id`
FROM `production_row_operation`
JOIN `stock` ON `stock`.`stock_id` = `production_row_operation`.`stock_id`
WHERE `production_row_operation`.`status` = 'İşlemde'
OR `production_row_operation`.`status` = 'Durdu'
OR `production_row_operation`.`status` = 'Devam'
AND `production_row_operation`.`operation_id` = '21'

                $bitti_count = $this->modelProductionOperation->where("status", "Bitti")->where("operation_id", session("user_item")["operation"])->countAllResults();

                $sevkler = $this->modelEmirler->orderBy("sevk_id", "DESC")->findAll();
                $kutular = $this->modelBox->findAll();
                foreach($kutular as $index => $satirlar){
                    $kutular[$index]["satirlar"] = $this->modelBoxRow->where("kutu_id", $satirlar["id"])->findAll();
                }
                $order_satirlar = $this->modelOrderRow->where("kutu_id !=", NULL)->findAll();


                $Kategoriler = $this->modelCategory->where("category_id", 115)->first();
                $kategori_urunleri = $this->modelStock->where("category_id", 115)->findAll();

                foreach($kategori_urunleri as &$urun){
                    $urun["stok_koli"] =  $this->modelRecipeItem->join('stock_recipe', 'stock_recipe.recipe_id = recipe_item.recipe_id')
                    ->join('stock', 'recipe_item.stock_id = stock.stock_id')
                    ->join('type', 'stock.type_id = type.type_id','left')
                    ->join('unit as buy_unit', 'buy_unit.unit_id = stock.buy_unit_id')
                    ->join('unit as sale_unit', 'sale_unit.unit_id = stock.sale_unit_id')
                    ->join('money_unit as buy_money_unit', 'buy_money_unit.money_unit_id = stock.buy_money_unit_id')
                    ->join('money_unit as sale_money_unit', 'sale_money_unit.money_unit_id = stock.sale_money_unit_id')
                    ->select('stock.*, type.type_title, stock_recipe.*, buy_unit.unit_value as buy_unit_value, sale_unit.unit_id as sale_unit_id, buy_money_unit.money_icon as buy_money_icon, sale_money_unit.money_icon as sale_money_icon, buy_money_unit.money_title as buy_money_title, sale_money_unit.money_title as sale_money_title, recipe_item.*')
                    ->where('stock_recipe.stock_id', $urun["stock_id"])
                    ->findAll();
                    foreach($urun["stok_koli"] as &$recete){
                        $recete["koli_recete"] = $this->modelRecipeItem->join('stock_recipe', 'stock_recipe.recipe_id = recipe_item.recipe_id')
                        ->join('stock', 'recipe_item.stock_id = stock.stock_id')
                        ->join('type', 'stock.type_id = type.type_id','left')
                        ->join('unit as buy_unit', 'buy_unit.unit_id = stock.buy_unit_id')
                        ->join('unit as sale_unit', 'sale_unit.unit_id = stock.sale_unit_id')
                        ->join('money_unit as buy_money_unit', 'buy_money_unit.money_unit_id = stock.buy_money_unit_id')
                        ->join('money_unit as sale_money_unit', 'sale_money_unit.money_unit_id = stock.sale_money_unit_id')
                        ->select('stock.*, type.type_title, stock_recipe.*, buy_unit.unit_value as buy_unit_value, sale_unit.unit_id as sale_unit_id, buy_money_unit.money_icon as buy_money_icon, sale_money_unit.money_icon as sale_money_icon, buy_money_unit.money_title as buy_money_title, sale_money_unit.money_title as sale_money_title, recipe_item.*')
                        ->where('stock_recipe.stock_id', $recete["stock_id"])
                        ->findAll();
---
SELECT *
FROM `boxes`
SELECT *
FROM `order_row`
WHERE `kutu_id` IS NOT NULL
AND `order_row`.`deleted_at` IS NULL
SELECT *
FROM `category`
WHERE `category_id` = 115
AND `category`.`deleted_at` IS NULL
 LIMIT 1
SELECT *
FROM `stock`
WHERE `category_id` = 115
AND `stock`.`deleted_at` IS NULL
SELECT `stock`.*, `type`.`type_title`, `stock_recipe`.*, `buy_unit`.`unit_value` as `buy_unit_value`, `sale_unit`.`unit_id` as `sale_unit_id`, `buy_money_unit`.`money_icon` as `buy_money_icon`, `sale_money_unit`.`money_icon` as `sale_money_icon`, `buy_money_unit`.`money_title` as `buy_money_title`, `sale_money_unit`.`money_title` as `sale_money_title`, `recipe_item`.*
FROM `recipe_item`
JOIN `stock_recipe` ON `stock_recipe`.`recipe_id` = `recipe_item`.`recipe_id`
JOIN `stock` ON `recipe_item`.`stock_id` = `stock`.`stock_id`
LEFT JOIN `type` ON `stock`.`type_id` = `type`.`type_id`
JOIN `unit` as `buy_unit` ON `buy_unit`.`unit_id` = `stock`.`buy_unit_id`
JOIN `unit` as `sale_unit` ON `sale_unit`.`unit_id` = `stock`.`sale_unit_id`
JOIN `money_unit` as `buy_money_unit` ON `buy_money_unit`.`money_unit_id` = `stock`.`buy_money_unit_id`
JOIN `money_unit` as `sale_money_unit` ON `sale_money_unit`.`money_unit_id` = `stock`.`sale_money_unit_id`
WHERE `stock_recipe`.`stock_id` = '85'
AND `recipe_item`.`deleted_at` IS NULL
SELECT `stock`.*, `type`.`type_title`, `stock_recipe`.*, `buy_unit`.`unit_value` as `buy_unit_value`, `sale_unit`.`unit_id` as `sale_unit_id`, `buy_money_unit`.`money_icon` as `buy_money_icon`, `sale_money_unit`.`money_icon` as `sale_money_icon`, `buy_money_unit`.`money_title` as `buy_money_title`, `sale_money_unit`.`money_title` as `sale_money_title`, `recipe_item`.*
FROM `recipe_item`
JOIN `stock_recipe` ON `stock_recipe`.`recipe_id` = `recipe_item`.`recipe_id`
JOIN `stock` ON `recipe_item`.`stock_id` = `stock`.`stock_id`
LEFT JOIN `type` ON `stock`.`type_id` = `type`.`type_id`
JOIN `unit` as `buy_unit` ON `buy_unit`.`unit_id` = `stock`.`buy_unit_id`
JOIN `unit` as `sale_unit` ON `sale_unit`.`unit_id` = `stock`.`sale_unit_id`
JOIN `money_unit` as `buy_money_unit` ON `buy_money_unit`.`money_unit_id` = `stock`.`buy_money_unit_id`
JOIN `money_unit` as `sale_money_unit` ON `sale_money_unit`.`money_unit_id` = `stock`.`sale_money_unit_id`
WHERE `stock_recipe`.`stock_id` = '82'
AND `recipe_item`.`deleted_at` IS NULL

    private function addInvoiceStatusToQuery()
    {

        return $this->InvoiceOutgoingStatusModel->findAll();
---
SELECT *
FROM `invoice_outgoing_status`
WHERE `invoice_outgoing_status`.`deleted_at` IS NULL