app/Controllers/TikoERP/MshApi.php

    public function msh_send_products(){

        $database = $this->siteConnect();

        $ModelStock = $this->modelStock->where("parent_id","<", 1)->findAll();




        $count = 0;
        foreach($ModelStock as $Stock){

            if($Stock["status"] == "active"){
                $durum = 1;
            }else{
                $durum = 0;
            }

            $catBul = $this->modelCategory->where("category_id", $Stock["category_id"])->first();
            $category = $catBul;

            $cleanTitle = $catBul['category_title'];
            $formattedTitle = $this->formatTitle($cleanTitle);

            $ustKategori = $database->table("kategorilers")->where("baslik", $catBul['category_title'])->get()->getResultObject();
---
SELECT *
FROM `stock`
WHERE `parent_id` = '<'
AND `stock`.`deleted_at` IS NULL
SELECT *
FROM `category`
WHERE `category_id` = '98'
AND `category`.`deleted_at` IS NULL
 LIMIT 1
SELECT *
FROM `kategorilers`
WHERE `baslik` = 'ZAMAK STOPERLER'

                'ustkategori' => $ustKategoriId,
                'durum' =>  $durum
            ];
            $sorgula = $database->table("urunlers")->where("baslik", $Stock["stock_title"])->get()->getResultObject();
---
SELECT *
FROM `urunlers`
WHERE `baslik` = 'ZS1'